In [2]:
import pandas as pd
import numpy as np

In [3]:
print("hola, Mundo")

hola, Mundo

In [4]:
print("Hola Campistas")

Hola Campistas

$$sqrt{k}$$
$$x=0$$
$a^{20}$
$$x = a_0 + \cfrac{b_1}{a_1 + \cfrac{b_2}{a_2 + \cfrac{b_3}{...}}}$$

<a> href="https://www.google.com">Enlace a Google</a>

$$\lim_{x\to\infty} \left(1 + {1\over n}\right)^n$$

$\sum_{n = 1}^{100} n$

$$
  \int_0^\infty \frac{x^3}{e^x-1}\,dx = \frac{\pi^4}{15}
$$

$$
\begin{align}
x + y &= 10\\
x - y &= 2
\end{align}
$$

In [5]:
from itertools import product
posibles = {"A","B","C"}
espacio_muestral = set(product(posibles,
repeat = 3))
print(espacio_muestral)

{('B', 'B', 'B'), ('C', 'C', 'A'), ('A', 'A', 'B'), ('A', 'B', 'B'), ('A', 'C', 'C'), ('B', 'B', 'A'), ('C', 'A', 'B'), ('B', 'A', 'C'), ('A', 'A', 'A'), ('C', 'C', 'C'), ('A', 'B', 'A'), ('C', 'A', 'A'), ('C', 'B', 'B'), ('B', 'C', 'B'), ('B', 'B', 'C'), ('A', 'A', 'C'), ('C', 'B', 'A'), ('A', 'B', 'C'), ('C', 'A', 'C'), ('B', 'C', 'A'), ('A', 'C', 'B'), ('B', 'A', 'B'), ('C', 'B', 'C'), ('C', 'C', 'B'), ('B', 'C', 'C'), ('A', 'C', 'A'), ('B', 'A', 'A')}

In [6]:
print("hola campistasb analisis de datos")

hola campistasb analisis de datos

In [7]:
import pandas as pd

### Analisis de Datos utilizando PANDAS

### 1 paso : Crear datos en una serie

In [8]:
# Esta es una serie de datos en panda
# esta es una lista
numero = [3,4,5,6,7,5,"Juan",0.2]
numero, type(numero)

([3, 4, 5, 6, 7, 5, 'Juan', 0.2], list)

In [9]:
#Ahora lista es una serie
numero = [3,4,5,6,7,]
serie= pd.Series(numero)
serie, type(serie)

(0    3
 1    4
 2    5
 3    6
 4    7
 dtype: int64,
 pandas.core.series.Series)

In [10]:
#Esto es un diccionario
data = {
    "Nombre":["Ana", "Pedro", "Veronica", "Mary", "Luis","Pablo"],
    "Edad":[22, 28, 25, 20, 18,25],
    "Ciudad":["Pasto", "Medellin", "Pereira", "Cali", "Popayan", "Bogota"]
}
data, type(data)

({'Nombre': ['Ana', 'Pedro', 'Veronica', 'Mary', 'Luis', 'Pablo'],
  'Edad': [22, 28, 25, 20, 18, 25],
  'Ciudad': ['Pasto', 'Medellin', 'Pereira', 'Cali', 'Popayan', 'Bogota']},
 dict)

In [11]:
# Pasar a Tabla ( DataFrame)-generar un 
# Dataframe a partir de un diccionario
df=pd.DataFrame(data=data)
df

     Nombre  Edad    Ciudad
0       Ana    22     Pasto
1     Pedro    28  Medellin
2  Veronica    25   Pereira
3      Mary    20      Cali
4      Luis    18   Popayan
5     Pablo    25    Bogota

In [12]:
# Exportar DataFrame
df.to_csv("data7.csv")

In [13]:
# importar DataFrame
import_df= pd.read_csv("data7.csv", index_col=0)
import_df

     Nombre  Edad    Ciudad
0       Ana    22     Pasto
1     Pedro    28  Medellin
2  Veronica    25   Pereira
3      Mary    20      Cali
4      Luis    18   Popayan
5     Pablo    25    Bogota

In [14]:
# Seleccionar una columna
nombres = df["Nombre"]
nombres

0         Ana
1       Pedro
2    Veronica
3        Mary
4        Luis
5       Pablo
Name: Nombre, dtype: object

In [15]:
# Seleccionar dos columnas
datos = df[["Nombre","Edad"]]
datos

     Nombre  Edad
0       Ana    22
1     Pedro    28
2  Veronica    25
3      Mary    20
4      Luis    18
5     Pablo    25

In [16]:
# Filtrar por indice
fila = df.loc[5]
fila

Nombre     Pablo
Edad          25
Ciudad    Bogota
Name: 5, dtype: object

In [17]:
# filtrar por Condición
df[df["Edad"]>20]

     Nombre  Edad    Ciudad
0       Ana    22     Pasto
1     Pedro    28  Medellin
2  Veronica    25   Pereira
5     Pablo    25    Bogota

In [18]:
filtro=(df["Edad"]>20) & (df["Nombre"].str.startswith("P"))
df[filtro]

  Nombre  Edad    Ciudad
1  Pedro    28  Medellin
5  Pablo    25    Bogota

In [19]:
# Filtrar por consulta
df.query("Edad> 20")

     Nombre  Edad    Ciudad
0       Ana    22     Pasto
1     Pedro    28  Medellin
2  Veronica    25   Pereira
5     Pablo    25    Bogota

In [20]:
# Filtrar por consulta
df.query("Edad < 30")

     Nombre  Edad    Ciudad
0       Ana    22     Pasto
1     Pedro    28  Medellin
2  Veronica    25   Pereira
3      Mary    20      Cali
4      Luis    18   Popayan
5     Pablo    25    Bogota

In [21]:
# Filtrar por nombre "isin"  
df[df["Nombre"].isin(["Ana","Carlos","Luis"])]

  Nombre  Edad   Ciudad
0    Ana    22    Pasto
4   Luis    18  Popayan

In [22]:
def longitud_5(nombre):
    return len(nombre) == 5
df[df["Nombre"].apply(longitud_5)]

  Nombre  Edad    Ciudad
1  Pedro    28  Medellin
5  Pablo    25    Bogota

In [23]:
df[df["Edad"].between(20,35)]

     Nombre  Edad    Ciudad
0       Ana    22     Pasto
1     Pedro    28  Medellin
2  Veronica    25   Pereira
3      Mary    20      Cali
5     Pablo    25    Bogota

In [24]:
df

     Nombre  Edad    Ciudad
0       Ana    22     Pasto
1     Pedro    28  Medellin
2  Veronica    25   Pereira
3      Mary    20      Cali
4      Luis    18   Popayan
5     Pablo    25    Bogota

In [25]:
import_df

     Nombre  Edad    Ciudad
0       Ana    22     Pasto
1     Pedro    28  Medellin
2  Veronica    25   Pereira
3      Mary    20      Cali
4      Luis    18   Popayan
5     Pablo    25    Bogota

### LIMPIEZA Y TRATAMIENTO DE DATOS CON NUMPY

#### INPUTACION DE DATOS - TRATAMIENTO DE DATOS INVALIDOS O FALTANTES

In [26]:
data = {
    "Nombre":["Ana", "Pedro", "Veronica", "Mary", "Luis","Pablo"],
    "Edad":[22, 28, np.nan ,20, 18,25],
    "Ciudad":["Pasto", "Medellin", "Pereira", "Cali", None, "Bogota"]
}
df=pd.DataFrame(data)
df

     Nombre  Edad    Ciudad
0       Ana  22.0     Pasto
1     Pedro  28.0  Medellin
2  Veronica   NaN   Pereira
3      Mary  20.0      Cali
4      Luis  18.0      None
5     Pablo  25.0    Bogota

In [27]:
# Rellenar datos con valores faltantes
df_fill = df.fillna(
  {
     "Edad" : df["Edad"].mean(),
     "Ciudad" :  "Desconocido"
  }   
  
)
df_fill

     Nombre  Edad       Ciudad
0       Ana  22.0        Pasto
1     Pedro  28.0     Medellin
2  Veronica  22.6      Pereira
3      Mary  20.0         Cali
4      Luis  18.0  Desconocido
5     Pablo  25.0       Bogota

In [28]:
df_sin_nan = df.dropna()
df_sin_nan

  Nombre  Edad    Ciudad
0    Ana  22.0     Pasto
1  Pedro  28.0  Medellin
3   Mary  20.0      Cali
5  Pablo  25.0    Bogota

In [29]:
#Reemplar valores especificos
df_reem = df.replace(
    {
     "Ciudad" = {"None":"Descocido", "x":"y"}
    }
)

SyntaxError: cannot assign to literal here. Maybe you meant '==' instead of '='? (4061777572.py, line 4)

## ADQUISICION DE DATOS EN LINEA

In [ ]:
import pandas as pd

# Cargar el archivo CSV
df = pd.read_csv("https://raw.githubusercontent.com/William-Burbano-Lima/Analisis_Datos_Explorador/main/Iris.csv")

# Mstrar las primeras filas del DataFrame
print(df.head())

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [31]:
# Cargar el archivo CSV del Titanic
df = pd.read_csv('https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv')

# Exploración inicial
print(df.describe())

       PassengerId    Survived      Pclass         Age       SibSp  \
count   891.000000  891.000000  891.000000  714.000000  891.000000
mean    446.000000    0.383838    2.308642   29.699118    0.523008
std     257.353842    0.486592    0.836071   14.526497    1.102743
min       1.000000    0.000000    1.000000    0.420000    0.000000
25%     223.500000    0.000000    2.000000   20.125000    0.000000
50%     446.000000    0.000000    3.000000   28.000000    0.000000
75%     668.500000    1.000000    3.000000   38.000000    1.000000
max     891.000000    1.000000    3.000000   80.000000    8.000000

            Parch        Fare
count  891.000000  891.000000
mean     0.381594   32.204208
std      0.806057   49.693429
min      0.000000    0.000000
25%      0.000000    7.910400
50%      0.000000   14.454200
75%      0.000000   31.000000
max      6.000000  512.329200

123

<img src="FONDO-PYTHON.JPG">

In [32]:
from IPython.display import HTML


<img src="FONDO2-PYTHON.jpg" width="600" height="400" align="center"/>

<div class="footer">
    &copy; 2024 William Burbano Lima
</div>

<iframe width="560" height="315" src="https://www.youtube.com/embed/YXo2p0j1XQA?si=idLPc6zpK5il9Fuz" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerpolicy="strict-origin-when-cross-origin" allowfullscreen></iframe>

PERMISOS ANTES DE LA INSTALACION

- Get-ExecutionPolicy
- Set-ExecutionPolicy RemoteSigned
- Set-ExecutionPolicy Unrestricted

CREAR ENTORNO VIRTUAL PYTHON

* 1)	Crear carpeta y ruta para entorno de trabajo.
* 2)	Crear archivo de requerimientos requirements.txt 
* 3)	Crear entorno virtual
* 4)	Activar el entorno virtual de trabajo

Python -m venv datos2

.\ANALISIS_DATOS_CON_PYTHON\Scripts\activate

pip install -r .\requirements.txt